### 데이터 입출력

In [1]:
import numpy as np 
import pandas as pd

In [2]:
%%writefile samples/sample.csv
c1, c2, c3              ## 첫번째줄은 header, column name   ## pd.read_csv의 기본(defalut)형태.
1, 1.11, one            ## 두번째줄부터 데이터가 나옴
2, 2.22, two
3, 3.33, three

Overwriting samples/sample.csv

### CSV 파일 입력

In [3]:
df = pd.read_csv('samples/sample.csv')      # sep=','가 생략되어 있음
df

,c1,c2,c3 ## 첫번째줄은 header,column name ## pd.read_csv의 기본(defalut)형태.
0,1,1.11,one ## 두번째줄부터 데이터가 나옴,NaN
1,2,2.22,two,NaN
2,3,3.33,three,NaN

In [4]:
%%writefile samples/sample2.csv       
1, 1.11, one                ## header가 없는 경우
2, 2.22, two
3, 3.33, three

Overwriting samples/sample2.csv

In [5]:
df = pd.read_csv('samples/sample2.csv')     ##  header가 없는 경우 read 해보면..아래와 같은 결과가 나온다.
df

   1   1.11  one                ## header가 없는 경우
0  2   2.22                                  two
1  3   3.33                                three

In [6]:
df = pd.read_csv('samples/sample2.csv', names=['c1', 'c2', 'c3'])   ## 위를 고치려면 옆에 names부터 입력해주면 해결가능.
df

   c1    c2                                    c3
0   1  1.11   one                ## header가 없는 경우
1   2  2.22                                   two
2   3  3.33                                 three

In [7]:
df = pd.read_csv('samples/sample.csv', index_col='c1')      ## c1을 index주기
df

,c2,c3 ## 첫번째줄은 header,column name ## pd.read_csv의 기본(defalut)형태.
c1,,,
1,1.11,one ## 두번째줄부터 데이터가 나옴,NaN
2,2.22,two,NaN
3,3.33,three,NaN

In [8]:
%%writefile samples/sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Overwriting samples/sample3.txt

In [9]:
pd.read_table('samples/sample3.txt', sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [10]:
%%writefile samples/sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting samples/sample4.txt

In [11]:
pd.read_csv('samples/sample4.txt', skiprows=[0, 1])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [12]:
%%writefile samples/sample5.csv
c1, c2, c3
1, 1.11, one
2, , two
누락, 3.33, three

Overwriting samples/sample5.csv

In [13]:
df = pd.read_csv('samples/sample5.csv', na_values=['누락', ' '])     ## 특정값을 NaN으로 처리할 때, 인수값(na_values)에 NaN 값으로 취급할 값 입력. 여기서는 '누락'과 ' '(space)를 'NaN'값으로 취급한 결과.
df

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

### CSV 파일 출력

In [14]:
df

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

In [15]:
df.to_csv('samples/sample6.csv', index=False)

In [16]:
df2 = pd.read_csv('samples/sample6.csv')
df2

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

In [17]:
df.to_csv('samples/sample7.txt', index=False, sep='|')      # | 으로 구분.  sample7.txt파일에서 확인가능.

In [18]:
df.to_csv('samples/sample8.tsv', index=False, sep='\t')     # tab 으로 구분.  sample8.tst파일에서 확인가능.

In [19]:
df.to_csv('samples/sample9.csv', index=False, na_rep='누락')     # Nan 값을 '누락'으로 표시

### 인터넷 상의 CSV 파일 입력

In [20]:
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")
df.head()           ## 인터넷에서 데이터를 가져와서 데이터프레임을 만들어줄 수도 있다.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S